# Git Haskell

Этот проект содержит учебные материалы и примеры по Haskell

## Проекты

### MergeSort
Небольшой проект для демонстрации алгоритма сортировки слиянием. Помимо саой сортировки выводит рекурсивный лог разбиения и слияния списков

### Gauss
Реализация метода Гаусса-Жордана для решения систем линенйных алгебраических уравнений
https://mathprofi.ru/metod_gaussa_dlya_chainikov.html

Метод содержит два этапа:
1. Прямой ход - приведение расширенной матрицы коэфициентов к верхнетреугольному виду методом умножения строк на скаляр и вычитания строк
2. Обратный ход - приведение матрицы к единичной путем тех же преобразований.

